In [14]:
import pandas as pd
df = pd.read_excel('score.xlsx',index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  사회        SW특기
지원번호
1번    강나래  구로고  197   90   85  100  85      Python
2번    강태원  구로고  184   40   35   50  25        Java
3번    강호림  가산고  168   80   75   70  75  Javascript
4번    김수찬  구로고  187   40   60   70  80
5번    김재욱  가산고  188   15   20   10  10
6번    박동현  가산고  202   80  100   95  80           C
7번    박혜정  구로고  188   55   65   45  35      PYTHON
8번    승근열  구로고  190  100   85   90  95          C#

In [4]:
# 데이터 계산정보 확인
# df컬럼 중 number에 해당되는 데이터의 개수, 평균, 표준편차, 최소값, 최대값
df.describe()

                키          국어          영어          수학         사회
count    8.000000    8.000000    8.000000    8.000000   8.000000
mean   188.000000   62.500000   65.625000   66.250000  60.625000
std      9.985704   29.519969   26.917533   30.325614  32.120032
min    168.000000   15.000000   20.000000   10.000000  10.000000
25%    186.250000   40.000000   53.750000   48.750000  32.500000
50%    188.000000   67.500000   70.000000   70.000000  77.500000
75%    191.750000   82.500000   85.000000   91.250000  81.250000
max    202.000000  100.000000  100.000000  100.000000  95.000000

In [8]:
# 데이터 수정
data = {
    '번호': [1, 2, 3, 4, 5, 6, 7],
    '이름': ['홍길동', '유관순', '이순신', '강감찬', '김구', '김유신', '홍길자'],
    '국어': [100, 80, 90, 60, 100, 80, 100],
    '영어': [100, 80, 90, 65, 100, 80, 100],
    '수학': [99, 85, 91, 67, 84, 71, 90],
    '합계': [299, 245, 271, 192, 284, 231, 290],
    '평균': [99.67, 81.67, 90.33, 64.0, 94.67, 77.0, 96.67],
    '등수': [0, 0, 0, 0, 0, 0, 0]
}

data

{'번호': [1, 2, 3, 4, 5, 6, 7],
 '이름': ['홍길동', '유관순', '이순신', '강감찬', '김구', '김유신', '홍길자'],
 '국어': [100, 80, 90, 60, 100, 80, 100],
 '영어': [100, 80, 90, 65, 100, 80, 100],
 '수학': [99, 85, 91, 67, 84, 71, 90],
 '합계': [299, 245, 271, 192, 284, 231, 290],
 '평균': [99.67, 81.67, 90.33, 64.0, 94.67, 77.0, 96.67],
 '등수': [0, 0, 0, 0, 0, 0, 0]}

In [ ]:
# DataFrame 생성
df = pd.DataFrame(data,index=['1번','번','3번','4번','5번','6번','7번'])
df.
df.describe()

             번호          국어          영어         수학          합계         평균   등수
count  7.000000    7.000000    7.000000   7.000000    7.000000   7.000000  7.0
mean   4.000000   87.142857   87.857143  83.857143  258.857143  86.287143  0.0
std    2.160247   14.960265   13.496031  11.320020   38.294597  12.765888  0.0
min    1.000000   60.000000   65.000000  67.000000  192.000000  64.000000  0.0
25%    2.500000   80.000000   80.000000  77.500000  238.000000  79.335000  0.0
50%    4.000000   90.000000   90.000000  85.000000  271.000000  90.330000  0.0
75%    5.500000  100.000000  100.000000  90.500000  287.000000  95.670000  0.0
max    7.000000  100.000000  100.000000  99.000000  299.000000  99.670000  0.0

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 1번 to 8번
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   학교      8 non-null      object
 2   키       8 non-null      int64
 3   국어      8 non-null      int64
 4   영어      8 non-null      int64
 5   수학      8 non-null      int64
 6   사회      8 non-null      int64
 7   SW특기    8 non-null      object
dtypes: int64(5), object(3)
memory usage: 576.0+ bytes

In [ ]:
df.to_csv('students.csv',encoding='utf-8')

In [ ]:
# 상위 5개의 데이터
df.head()

       이름   학교    키  국어  영어   수학  사회        SW특기
지원번호
1번    강나래  구로고  197  90  85  100  85      Python
2번    강태원  구로고  184  40  35   50  25        Java
3번    강호림  가산고  168  80  75   70  75  Javascript
4번    김수찬  구로고  187  40  60   70  80
5번    김재욱  가산고  188  15  20   10  10

In [ ]:
# 하위 5개의 데이터
df.tail()

       이름   학교    키   국어   영어  수학  사회    SW특기
지원번호
4번    김수찬  구로고  187   40   60  70  80
5번    김재욱  가산고  188   15   20  10  10
6번    박동현  가산고  202   80  100  95  80       C
7번    박혜정  구로고  188   55   65  45  35  PYTHON
8번    승근열  구로고  190  100   85  90  95      C#

In [24]:
df.values # 배열구조확인

array([['강나래', '구로고', 197, 90, 85, 100, 85, 'Python'],
       ['강태원', '구로고', 184, 40, 35, 50, 25, 'Java'],
       ['강호림', '가산고', 168, 80, 75, 70, 75, 'Javascript'],
       ['김수찬', '구로고', 187, 40, 60, 70, 80, ' '],
       ['김재욱', '가산고', 188, 15, 20, 10, 10, ' '],
       ['박동현', '가산고', 202, 80, 100, 95, 80, 'C'],
       ['박혜정', '구로고', 188, 55, 65, 45, 35, 'PYTHON'],
       ['승근열', '구로고', 190, 100, 85, 90, 95, 'C#']], dtype=object)

In [25]:
df.index # 배열 index

Index(['1번', '2번', '3번', '4번', '5번', '6번', '7번', '8번'], dtype='object', name='지원번호')

In [26]:
df.columns # 상단 컬럼 확인

Index(['이름', '학교', '키', '국어', '영어', '수학', '사회', 'SW특기'], dtype='object')

In [27]:
df.columns[0] # 컬럼의 0번째 확인

'이름'

In [28]:
df.index[0]

'1번'

In [ ]:
df.index[1:3] # index 슬라이싱

Index(['2번', '3번'], dtype='object', name='지원번호')

In [30]:
df.columns[1:3] # 컬럼 슬라이싱

Index(['학교', '키'], dtype='object')

In [ ]:
df.shape # df 크기 확인

(8, 8)

In [40]:
df = pd.read_excel('pandas_code.xlsx')
df.shape
df.head()

                  이름    학교  영어  수학  과학  사회        sw특기
0    Chucho Fibbings   구로고  54  61  78  34  Javascript
1     Ignacio Piwell  디지털고  73  78  43  29           C
2  Townsend Burnsell  디지털고  84  93  83  15      PYTHON
3       Ivie Camings  디지털고  43  84  60  44         NaN
4   Conrade Spedroni   구로고  62  97  59  88  Javascript

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      1000 non-null   object
 1   학교      1000 non-null   object
 2   영어      1000 non-null   int64
 3   수학      1000 non-null   int64
 4   과학      1000 non-null   int64
 5   사회      1000 non-null   int64
 6   sw특기    530 non-null    object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [42]:
df.describe()

                영어           수학           과학           사회
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     60.874000    72.397000    64.867000    51.674000
std      23.216613    16.236595    18.017545    24.794202
min      20.000000    45.000000    35.000000    10.000000
25%      42.000000    59.000000    50.000000    30.000000
50%      61.000000    72.000000    64.000000    51.500000
75%      80.000000    86.000000    81.000000    73.000000
max     100.000000   100.000000    95.000000    95.000000